Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A21B.tmx
Source language: en_us
Languages: zh_cn

source: Nuclear submarines collide in Atlantic
zh_cn: 核潜艇大西洋相撞

source: A Royal Navy nuclear submarine and a French vessel have been damaged in a collision deep below the surface of the Atlantic Ocean.
zh_cn: 大西洋深海区域，英国皇家海军一艘核潜艇与法方相撞，造成损伤。

source: HMS Vanguard and Le Triomphant, which were carrying nuclear missiles on routine patrols, are reported to have collided while submerged on 3 or 4 February.
zh_cn: HMS Vanguard和Le Triomphant，被报道在2月3或4号潜水时相撞，并都携带着核弹头执行巡航任务。

source: Between them they had about 250 sailors on board.
zh_cn: 相撞时共有大约250船员在艇上。

source: The Ministry of Defence initially refused to confirm the incident, saying it was not policy to comment on submarine operations.
zh_cn: 国防部起初拒绝证实这起事故，并说关于潜艇任务的事宜无可奉告。

source: This afternoon the First Sea Lord, Admiral Sir Jonathon Band, issued a statement saying the two vessels hit each other while travelling at very low speeds and no one was injured.
zh_cn: 今天下午首席海事大臣，海军上将Jonathon Band发表声明称，两艘舰艇低速相撞，并没有人员伤亡。

source: "We can confirm that the capability remained unaffected and there has been no compromise to nuclear safety," he said.
zh_cn: “我们能够证实，潜艇性能没有受到影响，而且也没有核安全的威胁。”他说。

source: The MoD said the Vanguard returned to its base in Faslane, Scotland, with only "scrapes".
zh_cn: 国防部称Vanguard回到了苏格兰Faslane的基地，只是“刮伤”。

source: Defence officials told guardian.co.uk the two submarines collided in what they said was an extraordinary accident.
zh_cn: 国防部官员告诉卫报，两艘潜艇的相撞是很不寻常的事故。

source: "They can't see each other in the water," one official said, raising questions about the submarines' sonar and why they did not detect one another.
zh_cn: “在水中他们互相看不见，”一位官员说，并对潜艇的声纳提出质疑，为什么之前没有探测到对方。

source: Opposition parties asked how the accident was possible.
zh_cn: 反对党觉得这起事故简直难以置信。

source: The SNP's Westminster leader, Angus Robertson, said: "The UK Ministry of Defence needs to explain how it is possible for a submarine carrying weapons of mass destruction to collide with another submarine carrying weapons of mass destruction in the middle of the world's second-largest ocean.
zh_cn: SNP西敏领袖Angus Robertson 说：“英国国防部需要解释究竟携带了大规模杀伤性武器的潜艇是怎样出现在世界第二大洋正中央相撞这一事故的。

source: "In contrast to MoD secrecy, the French military authorities publicised details of the incident on a website.
zh_cn: “与国防部的保密相反，法国军委当局在网上发布了这起事故的详情。

source: The MoD cannot hide behind operational secrecy and must make a statement on this as a priority."
zh_cn: 国防部不能对此隐而不报，必须尽早发表声明。”

source: The shadow defence secretary, Liam Fox, called the incident "extremely worrying".
zh_cn: 影子国防大臣Liam Fox 称这起事故是“严重的失误”。

source: The Liberal Democrat defence spokesman, Nick Harvey, said: "While the British nuclear fleet has a good safety record, if there were ever to be a bang it would be a mighty big one.
zh_cn: 自由民主党国防发言人Nick Harvey说：“尽管英国核舰艇有良好的安全纪录，但是如果有了相撞，还是很严重的。

source: The public entrust this equipment to the government confident that all possible precautions are being taken.
zh_cn: 大众对政府有信心，所有的预防措施都已经到位。

source: Now that this incident is public knowledge, the people of Britain, France and the rest of the world need to be reassured this can never happen again and that lessons are being learned."
zh_cn: 现在，这起事故妇孺皆知，英国人民，法国人民以及全世界人民应知道，类似事件不会重演，我们正在吸取教训。”

source: France's defence ministry said in a brief statement on 6 February that the Triomphant had struck "a submerged object (probably a container)" during a return journey from a patrol, damaging the sonar dome on the front of the submarine.
zh_cn: 法国国防部长在2月6日的简短声明中称Triomphant在巡逻返航时撞上了“一个潜水物（很可能是一个集装箱）”，并损坏了潜艇前部的声纳穹顶。

source: It said no crew members were injured and the nuclear security of the submarine had not been compromised.
zh_cn: 据称没有船员伤亡，潜艇安全也没有受到影响。

source: Today the ministry confirmed that another sub was involved, saying: "They briefly came into contact at a very low speed while submerged."
zh_cn: 今天部长承认另一艘潜艇也牵扯在内，说道：“在潜水的时候，他们就低速径直开了过来。”

source: After the accident, the French submarine returned to its base on L'Ile Longue, near Brest, under its own power and escorted by a frigate.
zh_cn: 事故之后，法国舰艇在一艘护卫舰的护送下，独自驱动回到了Brest附近的L'Ile Longue基地。

source: Vanguard, one of Britain's four V-class submarines that make up the Trident nuclear deterrent, each of which is capable of carrying up to 16 missiles, was said to have visible dents on its hull as it was towed home at the weekend.
zh_cn: Vanguard是英国4艘V级舰艇之一，他们组成三叉戟的核威慑力量，每一艘可携带多达16枚导弹。在周末拖回国时，据说它的船体上有可见的明显凹痕。

source: Inquiries are under way on both sides of the Channel.
zh_cn: 海峡两岸都在做进一步的调查。

source: Kate Hudson, the Campaign for Nuclear Disarmament chairwoman, described the incident as "a nuclear ?nightmare of the highest order".
zh_cn: Kate Hudson是核裁军阵营的女主席。她把这起事件描述为“最高规格的核噩梦”。

source: "The collision of two submarines, both with nuclear reactors and nuclear weapons on board, could have released vast amounts of radiation and scattered scores of nuclear warheads across the seabed," she said.
zh_cn: “两艘相撞的潜艇之上，都有核反应堆和核武器，很有可能释放大量的辐射，使海床上布满了核弹头。”她说。

source: "The dents reportedly visible on the British sub show the boats were no more than a couple of seconds away from total catastrophe."
zh_cn: “英国舰艇上可见的凹痕说明，我们与灾难擦肩而过。”

source: Hudson said it was the first time since the cold war that two nuclear-armed submarines were known to have collided.
zh_cn: Hudson说，自冷战以来，两艘核潜艇相撞还是头一次。

source: "These dangers are inherent whilst the British government maintains its 1960s policy of having at least one nuclear ?weapons submarine sailing round the Atlantic 24 hours a day, 365 days a year," she said.
zh_cn: “这些风险是固有的，因为英国政府保有了1960年的政策，即至少有一艘核舰艇一年365天每天24小时在大西洋巡逻。”她说。

source: "HMS Vanguard is likely to be confined to port for months with a multimillion-pound repair bill.
zh_cn: “HMS Vanguard很有可能要停在港口数月，并花费上百万英镑进行维修。

source: Gordon Brown should seize this opportunity to end continuous patrols."
zh_cn: 戈登布朗应该抓住这个机会，停止无休止的巡逻。”

source: Le Triomphant, which entered service in 1997, carries 16 nuclear missiles and is one of four nuclear-armed submarines in the French fleet.
zh_cn: Le Triomphant 1997年开始服役，携带16个核导弹，是法国舰队4艘核舰艇之一。

source: Stephane Lhomme, a spokesman for the French anti-nuclear group Sortir du Nucleaire, said its network of activists was on alert for any signs of radioactive leaks near French shores.
zh_cn: Stephane Lhomme是法国反核武器集团Sortir du Nuclearie发言人。他说，它们的成员正在对法国海岸任何的辐射泄露保持高度警惕。

source: "This reminds us that we could have a new catastrophe with a nuclear submarine at any moment.
zh_cn: “这告诉我们，有了核潜艇，我们随时有危险。

source: It is a risk that exists during missions but also in port," he said.
zh_cn: 这是任务时的危险，也是在港时的威胁。”他说。

source: "These are mobile nuclear reactors."
zh_cn: “它们是可移动的核反应堆。”
